1s/ERP/Conf/Catalogs/Лико_НастройкиФормыУчетаТрафаретныйУчасток.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_НастройкиФормыУчетаТрафаретныйУчасток</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипСетки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСоздать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделХранение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделВыдача</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделНаМашинах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСписанные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСнятые</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиФормы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Раздел</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Лико_Работы</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовоеНаименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомандаОперации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Включить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Повтор</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КнопкаПоУмолчанию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АвтоОперация</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_НастройкиФормыУчетаТрафаретныйУчасток/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура НастройкиФормыНаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Тип=Элементы.НастройкиФормы.ТекущиеДанные.Тип;
	Массив = Новый Массив;
	
	Если Тип="Команда" Тогда
		Массив.Добавить("Добавить");
		Массив.Добавить("КВыдаче");
		Массив.Добавить("Списание");
		Массив.Добавить("Выдать");
		Массив.Добавить("Приемка");
		Массив.Добавить("Снятие");
	Иначе
		ЗаполнитОперации(Массив); 		
	КонецЕсли;
	Элемент.СписокВыбора.ЗагрузитьЗначения(Массив);	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитОперации(Массив)
	
	Перем Запрос;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_Работы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Лико_Работы КАК Лико_Работы";
	Массив=Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецПроцедуры


&НаКлиенте
Процедура НастройкиФормыКомандаОперацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Тип=Элементы.НастройкиФормы.ТекущиеДанные.Тип;
	Массив = Новый Массив;
	
	Если Тип<>"Команда" Тогда
		Массив.Добавить("КВыдаче");
		Массив.Добавить("Списание");
		Массив.Добавить("Выдать");
		Массив.Добавить("Приемка");
		Массив.Добавить("Снятие");
	КонецЕсли;
	
	Элемент.СписокВыбора.ЗагрузитьЗначения(Массив);	
КонецПроцедуры


&НаКлиенте
Процедура ТипСеткиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		СтандартнаяОбработка=Ложь;
	ДанныеВыбора=ПолучитьСписок();

КонецПроцедуры
//Элементы.НастройкиФормы.ОтборСтрок


&НаСервере
Функция ПолучитьСписок() //+Лико m.shenderov 29.04.2019  
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеновыеГруппы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЦеновыеГруппы КАК ЦеновыеГруппы
	|ГДЕ
	|	ЦеновыеГруппы.Наименование ПОДОБНО ""%Сетка%""";
	
	Массив= Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	СписокЗначений = Новый СписокЗначений;
	Для каждого М Из Массив Цикл
		СписокЗначений.Добавить(М);
	КонецЦикла;
	Возврат СписокЗначений;
КонецФункции  //-Лико m.shenderov 29.04.2019
